{
  "magic": "E!vIA5L86J2I",
  "timestamp": "2024-04-16T01:02:13.449102+00:00",
  "repo": "italobusi/actn-wdm-pluggable-modelling",
  "labels": [
    {
      "name": "bug",
      "description": "Something isn't working",
      "color": "d73a4a"
    },
    {
      "name": "documentation",
      "description": "Improvements or additions to documentation",
      "color": "0075ca"
    },
    {
      "name": "duplicate",
      "description": "This issue or pull request already exists",
      "color": "cfd3d7"
    },
    {
      "name": "enhancement",
      "description": "New feature or request",
      "color": "a2eeef"
    },
    {
      "name": "good first issue",
      "description": "Good for newcomers",
      "color": "7057ff"
    },
    {
      "name": "help wanted",
      "description": "Extra attention is needed",
      "color": "008672"
    },
    {
      "name": "invalid",
      "description": "This doesn't seem right",
      "color": "e4e669"
    },
    {
      "name": "question",
      "description": "Further information is requested",
      "color": "d876e3"
    },
    {
      "name": "wontfix",
      "description": "This will not be worked on",
      "color": "ffffff"
    }
  ],
  "issues": [
    {
      "number": 1,
      "id": "I_kwDOLJuPKM5-kstg",
      "title": "Gap Analysis: Modelling of Optical Pluggables in Packet Over Optical Network",
      "url": "https://github.com/italobusi/actn-wdm-pluggable-modelling/issues/1",
      "state": "OPEN",
      "author": "dieterbeller",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "This gap analysis is trying to collect YANG models from various sources (primarily from IETF, OpenConfig, etc.) for modeling optical pluggables located in client devices like IP routers, which are connected to an optical WDM transport network. This material will be analyzed in order to identify potential gaps.\r\n\r\nReferences:\r\n- https://github.com/ietf-ccamp-wg/draft-ietf-ccamp-optical-impairment-topology-yang\r\n- https://github.com/ietf-ccamp-wg/ietf-ccamp-layer0-types-ext-RFC9093-bis\r\n- https://github.com/openconfig/public\r\n- etc.",
      "createdAt": "2024-02-07T17:41:06Z",
      "updatedAt": "2024-02-07T17:41:06Z",
      "closedAt": null,
      "comments": []
    },
    {
      "number": 2,
      "id": "I_kwDOLJuPKM5-4B_i",
      "title": "optical-pluggable-attributes-v00",
      "url": "https://github.com/italobusi/actn-wdm-pluggable-modelling/issues/2",
      "state": "OPEN",
      "author": "reza-github",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "All,\r\nAs per our discussion last week, attached is the Google Sheet for \"optical-pluggable-attributes-v00\".\r\n\r\nhttps://docs.google.com/spreadsheets/d/1atqBARO76hzRp5ETHzsOYLsfabHQbulf0AtbVAMV66A/edit?usp=share_link\r\n\r\nReza",
      "createdAt": "2024-02-10T17:18:39Z",
      "updatedAt": "2024-02-26T17:34:59Z",
      "closedAt": null,
      "comments": [
        {
          "author": "sergiobelotti",
          "authorAssociation": "COLLABORATOR",
          "body": "I've updated the list of attributes with some other IETF OI parameters I've noticed have not been reported yet\r\n[optical-pluggable-attributes-v00 (1).xlsx](https://github.com/italobusi/actn-wdm-pluggable-modelling/files/14335760/optical-pluggable-attributes-v00.1.xlsx)\r\n\r\nI've updated directly the on-line file \r\n",
          "createdAt": "2024-02-19T18:21:23Z",
          "updatedAt": "2024-02-26T17:34:59Z"
        }
      ]
    },
    {
      "number": 3,
      "id": "I_kwDOLJuPKM6AFcNm",
      "title": "Figures are wider than 72 characters",
      "url": "https://github.com/italobusi/actn-wdm-pluggable-modelling/issues/3",
      "state": "OPEN",
      "author": "italobusi",
      "authorAssociation": "OWNER",
      "assignees": [
        "reza-github"
      ],
      "labels": [],
      "body": "See XML2RFC warning messages",
      "createdAt": "2024-02-22T12:01:52Z",
      "updatedAt": "2024-02-22T18:27:21Z",
      "closedAt": null,
      "comments": [
        {
          "author": "italobusi",
          "authorAssociation": "OWNER",
          "body": "I would propose to pull out the figures from the main body as in PR #4 \r\n\r\nThen it is simpler to check whether each figure exceeds the 72 characters limit\r\n\r\nIt might be useful to check if there are some tools or scripts that can check and identify which lines are exceeding the 72 characters limit",
          "createdAt": "2024-02-22T18:27:20Z",
          "updatedAt": "2024-02-22T18:27:20Z"
        }
      ]
    },
    {
      "number": 5,
      "id": "I_kwDOLJuPKM6AM4Ye",
      "title": "Review of I-D 00 version ",
      "url": "https://github.com/italobusi/actn-wdm-pluggable-modelling/issues/5",
      "state": "OPEN",
      "author": "sergiobelotti",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "This issues has to collect possible comments/suggestions on the first version (00) of I-D proposed .",
      "createdAt": "2024-02-23T11:05:11Z",
      "updatedAt": "2024-02-24T11:22:04Z",
      "closedAt": null,
      "comments": [
        {
          "author": "sergiobelotti",
          "authorAssociation": "COLLABORATOR",
          "body": "Some comments:\r\n-_Normative reference_\r\nAdd Optical Impairments draft “A YANG Data Model for Optical Impairment-aware Topology”  [draft-ietf-ccamp-optical-impairment-topology-yang-14 - A YANG Data Model for Optical Impairment-aware Topology](https://datatracker.ietf.org/doc/draft-ietf-ccamp-optical-impairment-topology-yang/14/)\r\nAdd Interface model draft “A YANG model to manage the optical interface parameters for an external transponder in a WDM network” [draft-ietf-ccamp-dwdm-if-param-yang-10 - A YANG model to manage the optical interface parameters for an external transponder in a WDM network](https://datatracker.ietf.org/doc/draft-ietf-ccamp-dwdm-if-param-yang/)\r\n-_Abstract_\r\nI would change the sentence” Drawing from existing models in IETF, OpenConfig, ITU-T, OIF, and TAPI, this model offers enhanced uniform structuring and naming.” Into\r\n“Drawing from existing IETF models, maybe be complementing that with input from other standard or industrial forum models (ITU-T, OpenConfig , ONF TAPI  etc.) , this model offers enhanced uniform structuring and naming.”\r\nAbout the attributes as said we start with IETF attributes from Optical Impairment and then we need to understand if those are enough or not, and then we can dig into other models to see if e.g. OpenConfig is proposing something needed for us.\r\n\r\n “Additionally, it provides insight into the mapping to plug interface structures defined in CMIS.” \r\n\r\nAbout CMIS and the need to expose internal protocol between host and pluggable I’m personally not clear the need for that. \r\nConsidering the CMIS interface as a device-internal interface  I think that a very limited amount of information needs to be exposed to the controller defined in a YANG module. \r\nThe purpose of the YANG model should be to ensure that the transceiver optical pluggable is configured\r\nproperly from an optical WDM network perspective (TX/RX frequency setting/power setting/operational mode setting, etc).\r\n\r\n_-Introduction_\r\nI think we need to clarify and then converge, on what is the real purpose of this model. As I said in my view what we need to model is the necessary configuration parameters that are important from an optical transport network perspective. This seems map on the first bullet you have in the introduction:\r\n“Optical media interface: This defines the characteristics of the optical solution such as spectrum, polarization, and dispersion, which do not directly affect the behavior of the host packet device.”\r\nSo this bullet means that our model should provide the correct parameters needed for an optical PNC to calculate suitable optical circuit and spectrum allocation.\r\n\r\nI do not understand how the second and third bullet that you mention is affecting the needed attributes to be configured in the prospective of an optical feasibility computation. \r\nThe second bullet seems to me more an internal set of characteristics that should be clarified why would be need to expose.\r\nThe third bullet seems related to specific physical characteristics of the pluggable , we would need to go into details here to understand if needed to be exposed in the model.",
          "createdAt": "2024-02-23T11:06:48Z",
          "updatedAt": "2024-02-23T11:06:48Z"
        },
        {
          "author": "dieterbeller",
          "authorAssociation": "COLLABORATOR",
          "body": "General comments:\r\n\r\n- It looks like comments cannot be easily added to the I-D [draft-poidt-ccamp-actn-wdm-pluggable-modelling.md](https://github.com/italobusi/actn-wdm-pluggable-modelling/blob/main/draft-poidt-ccamp-actn-wdm-pluggable-modelling.md) in markdown format (maybe I just don't know how to do it).\r\n- I created the txt file based on [draft-poidt-ccamp-actn-wdm-pluggable-modelling.md](https://github.com/italobusi/actn-wdm-pluggable-modelling/blob/main/draft-poidt-ccamp-actn-wdm-pluggable-modelling.md) and pasted it into this comment below.\r\n- The txt file should always be put on GitHub next to the markdown file and should be kept in sync with the markdown file.\r\n\r\n```\r\nCommon Control and Measurement Plane                            R. Rokui\r\nInternet-Draft                                                     Ciena\r\nIntended status: Informational                                    A. Guo\r\nExpires: 27 August 2024                           Futurewei Technologies\r\n                                                               P. Bedard\r\n                                                                   Cisco\r\n                                                          B. Swamynathan\r\n                                                                   Nokia\r\n                                                              G. Grammel\r\n                                                                 Juniper\r\n                                                        24 February 2024\r\n\r\n\r\n     Modelling of Optical Pluggables in Packet Over Optical Network\r\n         draft-poidt-ccamp-actn-wdm-pluggable-modelling-latest\r\n\r\nAbstract\r\n\r\n   This draft outlines the modeling of optical pluggables within a host\r\n   packet device within the context of a packet over optical network.\r\n   The model encompasses all pertinent properties of the pluggable for\r\n   various packet over optical use cases and is partitioned into three\r\n   primary areas: the optical media interface, the electrical plug to\r\n   host interconnect, and the physical equipment of the pluggable.\r\n\r\n   Included in the model are representations of configuration, states,\r\n   and telemetry data, as well as profiles and coherent plug\r\n   capabilities.  Emphasizing the importance of considering both vendor-\r\n   agnostic and vendor-specific attributes in modeling coherent\r\n   pluggables.\r\n\r\n   Drawing from existing models in IETF, OpenConfig, ITU-T, OIF, and\r\n   TAPI, this model offers enhanced uniform structuring and naming.\r\n   Additionally, it provides insight into the mapping to plug interface\r\n   structures defined in CMIS.\r\n\r\nAbout This Document\r\n\r\n   This note is to be removed before publishing as an RFC.\r\n\r\n   The latest revision of this draft can be found at\r\n   https://italobusi.github.io/actn-wdm-pluggable-modelling/draft-poidt-\r\n   ccamp-actn-wdm-pluggable-modelling.html.  Status information for this\r\n   document may be found at https://datatracker.ietf.org/doc/draft-\r\n   poidt-ccamp-actn-wdm-pluggable-modelling/.\r\n\r\n\r\n\r\n\r\n\r\n\r\nRokui, et al.            Expires 27 August 2024                 [Page 1]\r\n\f\r\nInternet-Draft        Modelling Optical Pluggables         February 2024\r\n\r\n\r\n   Discussion of this document takes place on the Common Control and\r\n   Measurement Plane Working Group mailing list (mailto:ccamp@ietf.org),\r\n   which is archived at https://mailarchive.ietf.org/arch/browse/ccamp/.\r\n   Subscribe at https://www.ietf.org/mailman/listinfo/ccamp/.\r\n\r\n   Source for this draft and an issue tracker can be found at\r\n   https://github.com/italobusi/actn-wdm-pluggable-modelling.\r\n\r\nStatus of This Memo\r\n\r\n   This Internet-Draft is submitted in full conformance with the\r\n   provisions of BCP 78 and BCP 79.\r\n\r\n   Internet-Drafts are working documents of the Internet Engineering\r\n   Task Force (IETF).  Note that other groups may also distribute\r\n   working documents as Internet-Drafts.  The list of current Internet-\r\n   Drafts is at https://datatracker.ietf.org/drafts/current/.\r\n\r\n   Internet-Drafts are draft documents valid for a maximum of six months\r\n   and may be updated, replaced, or obsoleted by other documents at any\r\n   time.  It is inappropriate to use Internet-Drafts as reference\r\n   material or to cite them other than as \"work in progress.\"\r\n\r\n   This Internet-Draft will expire on 27 August 2024.\r\n\r\nCopyright Notice\r\n\r\n   Copyright (c) 2024 IETF Trust and the persons identified as the\r\n   document authors.  All rights reserved.\r\n\r\n   This document is subject to BCP 78 and the IETF Trust's Legal\r\n   Provisions Relating to IETF Documents (https://trustee.ietf.org/\r\n   license-info) in effect on the date of publication of this document.\r\n   Please review these documents carefully, as they describe your rights\r\n   and restrictions with respect to this document.  Code Components\r\n   extracted from this document must include Revised BSD License text as\r\n   described in Section 4.e of the Trust Legal Provisions and are\r\n   provided without warranty as described in the Revised BSD License.\r\n\r\nTable of Contents\r\n\r\n   1.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3\r\n   2.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\r\n   3.  Packet over optical converged network context . . . . . . . .   5\r\n   4.  Optical Pluggable Building Blocks . . . . . . . . . . . . . .   6\r\n   5.  Optical Pluggables Data Modeling  . . . . . . . . . . . . . .   7\r\n   6.  Optical Pluggables Yang Model . . . . . . . . . . . . . . . .   7\r\n   7.  Security Considerations . . . . . . . . . . . . . . . . . . .   7\r\n\r\n\r\n\r\nRokui, et al.            Expires 27 August 2024                 [Page 2]\r\n\f\r\nInternet-Draft        Modelling Optical Pluggables         February 2024\r\n\r\n\r\n   8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7\r\n   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   7\r\n     9.1.  Normative References  . . . . . . . . . . . . . . . . . .   7\r\n     9.2.  Informative References  . . . . . . . . . . . . . . . . .   8\r\n   Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .   8\r\n   Contributors  . . . . . . . . . . . . . . . . . . . . . . . . . .   8\r\n   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   8\r\n\r\n1.  Terminology\r\n\r\n   The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\",\r\n   \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and\r\n   \"OPTIONAL\" in this document are to be interpreted as described in\r\n   BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all\r\n   capitals, as shown here.\r\n\r\n   The following terms abbreviations are used in this document:\r\n\r\n   *  Optical Plug / Coherent Pluggables / Pluggable: A small form\r\n      factor coherent optical module\r\n\r\n   *  O-PNC: The control functions specializing in management/control of\r\n      optical and photonic functions (virtual or physical).  See\r\n      [RFC8453]\r\n\r\n   *  P-PNC: The control functions specializing in management/control of\r\n      packet functions (virtual or physical).  See [RFC8453]\r\n\r\n   *  CMIS: Content Management Interoperability Services developed by\r\n      OIF is an open standard that allows different content management\r\n      systems to inter-operate over the Internet\r\n\r\n   *  xPonder: Short for Transponder and/or Muxponder\r\n\r\n2.  Introduction\r\n\r\n   Packet traffic has been transmitted across optical networks for many\r\n   years, leveraging the advantages of optical transmission and\r\n   switching combined with packet switching.  Traditionally, optical\r\n   systems and packet systems have been distinct, each with their own\r\n   dedicated devices.\r\n\r\n   In numerous network setups, packet and optical networks have been\r\n   engineered, operated, and managed separately, leading to siloed\r\n   operations that can be suboptimal and inefficient.  The evolution of\r\n   both packet and optical systems has largely been independent.\r\n   Optical systems, in particular, have seen advancements in capacity,\r\n   especially with the adoption of coherent optical techniques.\r\n\r\n\r\n\r\nRokui, et al.            Expires 27 August 2024                 [Page 3]\r\n\f\r\nInternet-Draft        Modelling Optical Pluggables         February 2024\r\n\r\n\r\n   Advancements in optical component design have led to increased\r\n   density, enabling entire coherent optical terminal systems that\r\n   previously required multiple circuit packs to now fit into a single\r\n   small form factor \"coherent pluggable.\"  Integrating coherent\r\n   pluggables into devices with packet functions can result in reduced\r\n   network costs, power consumption, and footprint, while also enhancing\r\n   data transfer rates, reducing latency, and expanding capacity,\r\n   although in some cases, separate packet and optical solutions may\r\n   still be preferred due to other engineering and deployment\r\n   considerations.\r\n\r\n   These trends, coupled with the desire to utilize the best components\r\n   available, have given rise to open optical pluggables.  These\r\n   pluggables allow a plug from one vendor to be installed in a device\r\n   from another vendor with packet functions.  Communication between\r\n   coherent pluggables and the packet device host occurs through the\r\n   CMIS standard developed by OIF [OIF-CMIS].\r\n\r\n   While standardized transmission modes like ZR can handle basic\r\n   applications, proprietary modes from vendors are often necessary to\r\n   achieve optimal performance.\r\n\r\n   This draft outlines the modeling of an optical pluggable within a\r\n   host packet device within the context of a packet over optical\r\n   network.  The model presented in this document consolidates various\r\n   properties of optical pluggables into three key areas:\r\n\r\n   *  Optical media interface: This defines the characteristics of the\r\n      optical solution such as spectrum, polarization, and dispersion,\r\n      which do not directly affect the behavior of the host packet\r\n      device.\r\n\r\n   *  Electrical plug-to-host interconnect: This defines the\r\n      characteristics of the bus interconnect between the host and the\r\n      plug, such as lane count and FEC, which both the optical pluggable\r\n      and the packet host must understand and act upon.\r\n\r\n   *  Physical and functional aspects of the pluggable: This defines\r\n      attributes of the optical pluggable itself, such as plug type,\r\n      version, thermal characteristics, and power consumption, which\r\n      indirectly affect the packet host.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nRokui, et al.            Expires 27 August 2024                 [Page 4]\r\n\f\r\nInternet-Draft        Modelling Optical Pluggables         February 2024\r\n\r\n\r\n   The coherent pluggable model provides representations for\r\n   capabilities, profiles, configurations, and states and telemetry\r\n   data.  Capabilities are defined in profiles related to operational\r\n   modes, with some capabilities potentially being proprietary\r\n   Configurations include attributes for optical settings, monitoring\r\n   capabilities, and test capabilities, while state and telemetry data\r\n   include dynamic properties such as performance monitoring collections\r\n   and alarm notifications.\r\n\r\n   Both vendor-agnostic and vendor-specific attributes are important\r\n   considerations in the modeling of coherent pluggables.\r\n\r\n   The document is divided into the following sections:\r\n\r\n   *  Section 3: Packet over optical converged network context\r\n\r\n   *  Section 4: Coherent Pluggables Building Blocks\r\n\r\n   *  Section 5: Coherent Pluggables Data Modeling\r\n\r\n   *  Section 6: Coherent Pluggables Yang Model\r\n\r\n3.  Packet over optical converged network context\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nRokui, et al.            Expires 27 August 2024                 [Page 5]\r\n\f\r\nInternet-Draft        Modelling Optical Pluggables         February 2024\r\n\r\n\r\n                  |---------------|\r\n                  |   P-PNC(s),   |\r\n                  |   O-PNC(s),   |\r\n                  |   MDSC        |\r\n                  |---------------|\r\n                          ^\r\n                          |  (A)\r\n      +-------------------|-------------------+\r\n      |                   |                   |  Packet Device\r\n      |                   V                   |  Vendor X\r\n      |        |---------------------|        |  (i.e, Host)\r\n      |        |                     |        |\r\n      |        v                     v        |\r\n      |  |-----------|          |----------|  |\r\n      |  | Packet    |          | Coherent |  |\r\n      |  | Function  |..........| Plug     |  |\r\n      |  | Data      |          | Data     |  |\r\n      |  |-----------|          |----------|  |\r\n      |        .                      .       |\r\n      |        .                      . (B)   |\r\n      |        .                      .       |\r\n      |  |--------------|   (C)   |------------------|  (D)\r\n      |  |Packet Device |<------->| Coherent Plug #1 |=======\r\n      |  |Function      |<---|    | Vendor X         |\r\n      |  |--------------|    |    |------------------|\r\n      |                      |                |\r\n      |                      |    |------------------|\r\n      |                      |--->| Coherent Plug #2 |=======\r\n      |                           | Vendor Y         |\r\n      |                           |------------------|\r\n      |                                       |\r\n      +---------------------------------------+\r\n\r\n  Legend\r\n    (A) Packet device management interfaces (e.g., YANG, NETCONF, gNMI, etc.)\r\n    (B) CMIS interface between Optical pluggable and Host\r\n    (C) Host side of the optical pluggable (towards the Host)\r\n    (D) Media side of the optical pluggable (towards Optical/Photonic network)\r\n\r\n           Figure 1: Packet device with optical pluggables\r\n\r\n4.  Optical Pluggable Building Blocks\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nRokui, et al.            Expires 27 August 2024                 [Page 6]\r\n\f\r\nInternet-Draft        Modelling Optical Pluggables         February 2024\r\n\r\n\r\n     Optical Pluggable\r\n     |--------------------------------------------------------------------------|\r\n     |                                                                          |\r\n     |                Host side                         Media side              |\r\n     | |---------------------------------|  |---------------------------------| |\r\n     | |                                 |  |                                 | |\r\n     | | |-----------|    |-----------|  |  | |-----------|    |-----------|  | |\r\n  -------| Electrical|    | Host      |  |  | | Media     |    | Optical   | -----> (Tx)\r\n  -------| Channel   |----| Logical   |-------| Logical   |....| Channel   | <----- (Rx)\r\n  -------|           |    | Channels  |  |  | | Channels  |    | (OTSI)    |  | |\r\n     | | |-----------|    |-----------|  |  | |-----------|    |-----------|  | |\r\n     | |                                 |  |                                 | |\r\n     | |---------------------------------|  |---------------------------------| |\r\n     |                                                                          |\r\n     | |----------------------------------------------------------------------| |\r\n     | |                            Equipment/inventory                       | |\r\n     | |----------------------------------------------------------------------| |\r\n     |                                                                          |\r\n     |--------------------------------------------------------------------------|\r\n\r\n             Figure 2: Optical Pluggable Building Blocks\r\n\r\n5.  Optical Pluggables Data Modeling\r\n\r\n6.  Optical Pluggables Yang Model\r\n\r\n7.  Security Considerations\r\n\r\n   TODO Security\r\n\r\n8.  IANA Considerations\r\n\r\n   This document has no IANA actions.\r\n\r\n9.  References\r\n\r\n9.1.  Normative References\r\n\r\n   [OIF-CMIS] OIF Forum, \"OIF Implementation Agreement (IA) Common\r\n              Management Interface Specification (CMIS))\", OIF CMIS IA ,\r\n              April 2022, <https://www.oiforum.com/wp-content/uploads/\r\n              OIF-CMIS-05.2.pdf>.\r\n\r\n   [RFC2119]  Bradner, S., \"Key words for use in RFCs to Indicate\r\n              Requirement Levels\", BCP 14, RFC 2119,\r\n              DOI 10.17487/RFC2119, March 1997,\r\n              <https://www.rfc-editor.org/rfc/rfc2119>.\r\n\r\n\r\n\r\n\r\nRokui, et al.            Expires 27 August 2024                 [Page 7]\r\n\f\r\nInternet-Draft        Modelling Optical Pluggables         February 2024\r\n\r\n\r\n   [RFC8174]  Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC\r\n              2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174,\r\n              May 2017, <https://www.rfc-editor.org/rfc/rfc8174>.\r\n\r\n9.2.  Informative References\r\n\r\n   [RFC8453]  Ceccarelli, D., Ed. and Y. Lee, Ed., \"Framework for\r\n              Abstraction and Control of TE Networks (ACTN)\", RFC 8453,\r\n              DOI 10.17487/RFC8453, August 2018,\r\n              <https://www.rfc-editor.org/rfc/rfc8453>.\r\n\r\nAcknowledgments\r\n\r\n   TODO acknowledge.\r\n\r\nContributors\r\n\r\n   Nigel Davis\r\n   Ciena\r\n   Email: ndavis@ciena.com\r\n\r\n\r\n   Italo Busi\r\n   Huawei Technologies\r\n   Email: italo.busi@huawei.com\r\n\r\n\r\n   Sergio Belotti\r\n   Nokia\r\n   Email: sergio.belotti@nokia.com\r\n\r\n\r\n   Dieter Beller\r\n   Nokia\r\n   Email: dieter.beller@nokia.com\r\n\r\n\r\n   Roberto Manzotti\r\n   Cisco\r\n   Email: rmanzott@cisco.com\r\n\r\n\r\nAuthors' Addresses\r\n\r\n   Reza Rokui\r\n   Ciena\r\n   Email: rrokui@ciena.com\r\n\r\n\r\n\r\n\r\nRokui, et al.            Expires 27 August 2024                 [Page 8]\r\n\f\r\nInternet-Draft        Modelling Optical Pluggables         February 2024\r\n\r\n\r\n   Aihua Guo\r\n   Futurewei Technologies\r\n   Email: aihuaguo.ietf@gmail.com\r\n\r\n\r\n   Phil Bedard\r\n   Cisco\r\n   Email: phbedard@cisco.com\r\n\r\n\r\n   B Swamynathan\r\n   Nokia\r\n   Email: swamynathan.b@nokia.com\r\n\r\n\r\n   Gert Grammel\r\n   Juniper\r\n   Email: ggrammel@juniper.net\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nRokui, et al.            Expires 27 August 2024                 [Page 9]\r\n```\r\n\r\n",
          "createdAt": "2024-02-24T11:04:51Z",
          "updatedAt": "2024-02-24T11:11:26Z"
        },
        {
          "author": "dieterbeller",
          "authorAssociation": "COLLABORATOR",
          "body": "Afaik, an OIF Implementation Agreement (IA) cannot be a normative reference in an IETF RFC:\r\n\r\n```\r\n9.1.  Normative References\r\n\r\n   [OIF-CMIS] OIF Forum, \"OIF Implementation Agreement (IA) Common\r\n              Management Interface Specification (CMIS))\", OIF CMIS IA ,\r\n              April 2022, <https://www.oiforum.com/wp-content/uploads/\r\n              OIF-CMIS-05.2.pdf>.\r\n```\r\nIt can only be an informative reference!\r\n\r\nI concur with the comment from @sergiobelotti above that the CMIS interface is a device-internal interface and the configuration parameters for pluggables, which shall be exposed to controllers via a potential YANG model (those relevant for the optical WDM transport network), must be selected carefully. This is at least my understanding of the scope of this draft.",
          "createdAt": "2024-02-24T11:22:03Z",
          "updatedAt": "2024-02-24T11:22:03Z"
        }
      ]
    }
  ],
  "pulls": [
    {
      "number": 4,
      "id": "PR_kwDOLJuPKM5nri1D",
      "title": "Proposal to pull out figures",
      "url": "https://github.com/italobusi/actn-wdm-pluggable-modelling/pull/4",
      "state": "OPEN",
      "author": "italobusi",
      "authorAssociation": "OWNER",
      "assignees": [],
      "labels": [],
      "body": "",
      "createdAt": "2024-02-22T18:25:28Z",
      "updatedAt": "2024-02-22T18:25:29Z",
      "baseRepository": "italobusi/actn-wdm-pluggable-modelling",
      "baseRefName": "main",
      "baseRefOid": "17635459c0bc28980dadf18d51ad36c0709362c7",
      "headRepository": "italobusi/actn-wdm-pluggable-modelling",
      "headRefName": "figures",
      "headRefOid": "2e677f886f798377996706911373c6df1555ceba",
      "closedAt": null,
      "mergedAt": null,
      "mergedBy": null,
      "mergeCommit": null,
      "comments": [],
      "reviews": []
    }
  ]
}